Every-Flavor-Robotics/motorgo-arduino/board_definitions/motorgo_1.0/variants/motorgomini_v1_r1/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#include "soc/soc_caps.h"

#define USB_VID 0x303a
#define USB_PID 0x1001

// #define EXTERNAL_NUM_INTERRUPTS 46
// #define NUM_DIGITAL_PINS 48
// #define NUM_ANALOG_INPUTS 20

#define analogInputToDigitalPin(p) \
  (((p) < 20) ? (analogChannelToDigitalPin(p)) : -1)
#define digitalPinToInterrupt(p) (((p) < 48) ? (p) : -1)
#define digitalPinHasPWM(p) (p < 46)

// A flag to indicate a GPIO pin is not set
#define MOTORGO_GPIO_NOT_SET 0xFF

// Green built-in LED
static const uint8_t LED_BUILTIN = 38;
// LED used to indicate network activity
static const uint8_t LED_NETWORK = 8;
#define BUILTIN_LED LED_BUILTIN  // backward compatibility
#define LED_BUILTIN LED_BUILTIN

static const uint8_t TX = 43;
static const uint8_t RX = 44;

static const uint8_t SDA = 38;
static const uint8_t SCL = 39;
static const uint8_t QWIIC_SDA = SDA;
static const uint8_t QWIIC_SCL = SCL;

static const uint8_t ENC_SDA = 35;
static const uint8_t ENC_SCL = 36;
// Encoder uses SSI, but we still need to define MOSI
// Pin 45 is not connected to anything, so we can use it
static const uint8_t ENC_MOSI = 45;

// ch0 Motor and Encoder pins
static const uint8_t CH0_ENC_CS = 37;
static const uint8_t CH0_UH = 18;
static const uint8_t CH0_UL = 15;
static const uint8_t CH0_VH = 17;
static const uint8_t CH0_VL = 5;
static const uint8_t CH0_WH = 16;
static const uint8_t CH0_WL = 6;
static const uint8_t CH0_CURRENT_U = 7;
static const uint8_t CH0_CURRENT_W = MOTORGO_GPIO_NOT_SET;
static const uint8_t CH0_CURRENT_W = 4;

// ch1 Motor and Encoder pins
static const uint8_t CH1_ENC_CS = 48;
static const uint8_t CH1_UH = 9;
static const uint8_t CH1_UL = 13;
static const uint8_t CH1_VH = 10;
static const uint8_t CH1_VL = 21;
static const uint8_t CH1_WH = 11;
static const uint8_t CH1_WL = 14;
static const uint8_t CH1_CURRENT_U = 47;
static const uint8_t CH1_CURRENT_W = MOTORGO_GPIO_NOT_SET;
static const uint8_t CH1_CURRENT_W = 12;

static const uint8_t CURRENT_SENSE_AMP_GAIN = 200;
static const uint8_t CURRENT_SENSE_RESISTANCE_mOHM = 3;

static const uint8_t SS = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 13;
static const uint8_t SCK = 12;

// static const uint8_t A0 = 1;
// static const uint8_t A1 = 2;
// static const uint8_t A2 = 3;
// static const uint8_t A3 = 4;
// static const uint8_t A4 = 5;
// static const uint8_t A5 = 6;
// static const uint8_t A6 = 7;
// static const uint8_t A7 = 8;
// static const uint8_t A8 = 9;
// static const uint8_t A9 = 10;
// static const uint8_t A10 = 11;
// static const uint8_t A11 = 12;
// static const uint8_t A12 = 13;
// static const uint8_t A13 = 14;
// static const uint8_t A14 = 15;
// static const uint8_t A15 = 16;
// static const uint8_t A16 = 17;
// static const uint8_t A17 = 18;
// static const uint8_t A18 = 19;
// static const uint8_t A19 = 20;

// static const uint8_t T1 = 1;
// static const uint8_t T2 = 2;
// static const uint8_t T3 = 3;
// static const uint8_t T4 = 4;
// static const uint8_t T5 = 5;
// static const uint8_t T6 = 6;
// static const uint8_t T7 = 7;
// static const uint8_t T8 = 8;
// static const uint8_t T9 = 9;
// static const uint8_t T10 = 10;
// static const uint8_t T11 = 11;
// static const uint8_t T12 = 12;
// static const uint8_t T13 = 13;
// static const uint8_t T14 = 14;

#endif /* Pins_Arduino_h */